evidence/2026-03-19/bff-load-test-account-overview-ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /api/v1/customer/account-overview
Document Length:        349 bytes

Concurrency Level:      20
Time taken for tests:   0.340 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      713000 bytes
HTML transferred:       349000 bytes
Requests per second:    2939.19 [#/sec] (mean)
Time per request:       6.805 [ms] (mean)
Time per request:       0.340 [ms] (mean, across all concurrent requests)
Transfer rate:          2046.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:     1    6   3.1      6      24
Waiting:        1    6   3.0      5      24
Total:          2    7   3.1      6      25

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      9
  90%     11
  95%     12
  98%     15
  99%     16
 100%     25 (longest request)