evidence/2026-03-19/docker-bff-dashboard-ab-20260319-150832.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /api/v1/customer/dashboard
Document Length:        Variable

Concurrency Level:      20
Time taken for tests:   0.477 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1032847 bytes
HTML transferred:       668847 bytes
Requests per second:    2098.09 [#/sec] (mean)
Time per request:       9.532 [ms] (mean)
Time per request:       0.477 [ms] (mean, across all concurrent requests)
Transfer rate:          2116.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:     2    9   4.2      8      30
Waiting:        2    9   4.1      8      30
Total:          2    9   4.2      9      30

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     12
  90%     15
  95%     18
  98%     21
  99%     24
 100%     30 (longest request)